; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v7 ?v13)
             (pred_8 ?v3 ?v6)
             (pred_4 ?v7 ?v6)
             (pred_5 ?v9 ?v7 )
	     (pred_11 ?v7)
             (pred_2 ?v5)
             (pred_1 ?v3)
             (pred_9 ?v6)
             (pred_7 ?v7)
             (pred_3 ?v3)
             (pred_12 ?v7)
             (pred_6 ))



(:action op_2
:parameters (?v8 ?v4 ?v12 ?v11)
:precondition (and (pred_2 ?v8) (pred_2 ?v4) (pred_1 ?v12) (pred_9 ?v11)
          (pred_10 ?v8 ?v4) (pred_8 ?v12 ?v11)
                   (pred_4 ?v4 ?v11) (pred_11 ?v8) 
                   (pred_7 ?v4) (pred_3 ?v12))
:effect (and  (pred_12 ?v4) (not (pred_7 ?v4))))


(:action op_4
:parameters (?v8 ?v2)
:precondition (and (pred_2 ?v8) (pred_2 ?v2)
               (pred_11 ?v8) (pred_10 ?v8 ?v2) (pred_12 ?v2))
:effect (and (pred_11 ?v2) (not (pred_11 ?v8))))

(:action op_1
:parameters (?v8 ?v12)
:precondition (and (pred_2 ?v8) (pred_1 ?v12) 
                  (pred_11 ?v8) (pred_5 ?v12 ?v8) (pred_6 ))
:effect (and (pred_3 ?v12)
   (not (pred_5 ?v12 ?v8)) (not (pred_6 ))))


(:action op_3
:parameters (?v8 ?v10 ?v1)
:precondition (and (pred_2 ?v8) (pred_1 ?v10) (pred_1 ?v1)
                  (pred_11 ?v8) (pred_3 ?v1) (pred_5 ?v10 ?v8))
:effect (and (pred_3 ?v10) (pred_5 ?v1 ?v8)
        (not (pred_3 ?v1)) (not (pred_5 ?v10 ?v8))))

(:action op_5
:parameters (?v8 ?v12)
:precondition (and (pred_2 ?v8) (pred_1 ?v12) 
                  (pred_11 ?v8) (pred_3 ?v12))
:effect (and (pred_6 ) (pred_5 ?v12 ?v8) (not (pred_3 ?v12)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_01 obj_15 obj_08 obj_13 obj_26 obj_07 obj_31 obj_05 obj_29 obj_22 obj_11 obj_02 obj_21 obj_30 obj_10 obj_04 obj_09 obj_06 obj_25 obj_27 obj_24 obj_18 obj_17 obj_12 obj_20
    obj_16 obj_23 obj_03
    obj_19 obj_14 obj_28
    )

    (:init
       (pred_6)

       (pred_2 obj_01)
       (pred_2 obj_15)
       (pred_2 obj_08)
       (pred_2 obj_13)
       (pred_2 obj_26)
       (pred_2 obj_07)
       (pred_2 obj_31)
       (pred_2 obj_05)
       (pred_2 obj_29)
       (pred_2 obj_22)
       (pred_2 obj_11)
       (pred_2 obj_02)
       (pred_2 obj_21)
       (pred_2 obj_30)
       (pred_2 obj_10)
       (pred_2 obj_04)
       (pred_2 obj_09)
       (pred_2 obj_06)
       (pred_2 obj_25)
       (pred_2 obj_27)
       (pred_2 obj_24)
       (pred_2 obj_18)
       (pred_2 obj_17)
       (pred_2 obj_12)
       (pred_2 obj_20)
       (pred_9 obj_16)
       (pred_9 obj_23)
       (pred_9 obj_03)
       (pred_1 obj_19)
       (pred_1 obj_14)
       (pred_1 obj_28)

       (pred_10 obj_01 obj_07)
       (pred_10 obj_01 obj_15)
       (pred_10 obj_15 obj_31)
       (pred_10 obj_15 obj_08)
       (pred_10 obj_15 obj_01)
       (pred_10 obj_08 obj_05)
       (pred_10 obj_08 obj_13)
       (pred_10 obj_08 obj_15)
       (pred_10 obj_13 obj_29)
       (pred_10 obj_13 obj_26)
       (pred_10 obj_13 obj_08)
       (pred_10 obj_26 obj_22)
       (pred_10 obj_26 obj_13)
       (pred_10 obj_07 obj_11)
       (pred_10 obj_07 obj_31)
       (pred_10 obj_07 obj_01)
       (pred_10 obj_31 obj_02)
       (pred_10 obj_31 obj_05)
       (pred_10 obj_31 obj_15)
       (pred_10 obj_31 obj_07)
       (pred_10 obj_05 obj_21)
       (pred_10 obj_05 obj_29)
       (pred_10 obj_05 obj_08)
       (pred_10 obj_05 obj_31)
       (pred_10 obj_29 obj_30)
       (pred_10 obj_29 obj_22)
       (pred_10 obj_29 obj_13)
       (pred_10 obj_29 obj_05)
       (pred_10 obj_22 obj_10)
       (pred_10 obj_22 obj_26)
       (pred_10 obj_22 obj_29)
       (pred_10 obj_11 obj_04)
       (pred_10 obj_11 obj_02)
       (pred_10 obj_11 obj_07)
       (pred_10 obj_02 obj_09)
       (pred_10 obj_02 obj_21)
       (pred_10 obj_02 obj_31)
       (pred_10 obj_02 obj_11)
       (pred_10 obj_21 obj_06)
       (pred_10 obj_21 obj_30)
       (pred_10 obj_21 obj_05)
       (pred_10 obj_21 obj_02)
       (pred_10 obj_30 obj_25)
       (pred_10 obj_30 obj_10)
       (pred_10 obj_30 obj_29)
       (pred_10 obj_30 obj_21)
       (pred_10 obj_10 obj_27)
       (pred_10 obj_10 obj_22)
       (pred_10 obj_10 obj_30)
       (pred_10 obj_04 obj_24)
       (pred_10 obj_04 obj_09)
       (pred_10 obj_04 obj_11)
       (pred_10 obj_09 obj_18)
       (pred_10 obj_09 obj_06)
       (pred_10 obj_09 obj_02)
       (pred_10 obj_09 obj_04)
       (pred_10 obj_06 obj_17)
       (pred_10 obj_06 obj_25)
       (pred_10 obj_06 obj_21)
       (pred_10 obj_06 obj_09)
       (pred_10 obj_25 obj_12)
       (pred_10 obj_25 obj_27)
       (pred_10 obj_25 obj_30)
       (pred_10 obj_25 obj_06)
       (pred_10 obj_27 obj_20)
       (pred_10 obj_27 obj_10)
       (pred_10 obj_27 obj_25)
       (pred_10 obj_24 obj_18)
       (pred_10 obj_24 obj_04)
       (pred_10 obj_18 obj_17)
       (pred_10 obj_18 obj_09)
       (pred_10 obj_18 obj_24)
       (pred_10 obj_17 obj_12)
       (pred_10 obj_17 obj_06)
       (pred_10 obj_17 obj_18)
       (pred_10 obj_12 obj_20)
       (pred_10 obj_12 obj_25)
       (pred_10 obj_12 obj_17)
       (pred_10 obj_20 obj_27)
       (pred_10 obj_20 obj_12)
       (pred_7 obj_11)
       (pred_7 obj_25)
       (pred_7 obj_21)
       (pred_4  obj_11 obj_16)
       (pred_4  obj_25 obj_23)
       (pred_4  obj_21 obj_03)
       (pred_12 obj_01)
       (pred_12 obj_15)
       (pred_12 obj_08)
       (pred_12 obj_13)
       (pred_12 obj_26)
       (pred_12 obj_07)
       (pred_12 obj_31)
       (pred_12 obj_05)
       (pred_12 obj_29)
       (pred_12 obj_22)
       (pred_12 obj_02)
       (pred_12 obj_30)
       (pred_12 obj_10)
       (pred_12 obj_04)
       (pred_12 obj_09)
       (pred_12 obj_06)
       (pred_12 obj_27)
       (pred_12 obj_24)
       (pred_12 obj_18)
       (pred_12 obj_17)
       (pred_12 obj_12)
       (pred_12 obj_20)

       (pred_8  obj_19 obj_16)
       (pred_8  obj_14 obj_23)
       (pred_8  obj_28 obj_03)
       (pred_5 obj_19 obj_01)
       (pred_5 obj_14 obj_07)
       (pred_5 obj_28 obj_06)
       (pred_11 obj_10)
    )

    (:goal (and
       (pred_5 obj_14 obj_01)
    ))
(:constraints
  (always (not (pred_11 obj_29)))
)
)

; plan
1. (op_4 obj_10 obj_22)
   deleted: (pred_11 obj_10)
   added: (pred_11 obj_22)
   goals met: 0 of 1
2. (op_4 obj_22 obj_26)
   deleted: (pred_11 obj_22)
   added: (pred_11 obj_26)
   goals met: 0 of 1
3. (op_4 obj_26 obj_13)
   deleted: (pred_11 obj_26)
   added: (pred_11 obj_13)
   goals met: 0 of 1
4. (op_4 obj_13 obj_08)
   deleted: (pred_11 obj_13)
   added: (pred_11 obj_08)
   goals met: 0 of 1
5. (op_4 obj_08 obj_15)
   deleted: (pred_11 obj_08)
   added: (pred_11 obj_15)
   goals met: 0 of 1
6. (op_4 obj_15 obj_01)
   deleted: (pred_11 obj_15)
   added: (pred_11 obj_01)
   goals met: 0 of 1
7. (op_4 obj_01 obj_07)
   deleted: (pred_11 obj_01)
   added: (pred_11 obj_07)
   goals met: 0 of 1
8. (op_1 obj_07 obj_14)
   deleted: (pred_5 obj_14 obj_07) (pred_6)
   added: (pred_3 obj_14)
   goals met: 0 of 1
9. (op_4 obj_07 obj_01)
   deleted: (pred_11 obj_07)
   added: (pred_11 obj_01)
   goals met: 0 of 1
10. (op_3 obj_01 obj_19 obj_14)
   deleted: (pred_3 obj_14) (pred_5 obj_19 obj_01)
   added: (pred_3 obj_19) (pred_5 obj_14 obj_01)
   goals met: 1 of 1
